Revit 2027 API
BasePoint.SharedPosition Property
 Shared position of the BasePoint based on the active ProjectLocation of its belonging Document. To get the shared position under other ProjectLocations, please use ProjectLocation.GetProjectPosition(BasePoint.Position).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ SharedPosition { get; }
Public ReadOnly Property SharedPosition As XYZ
	Get
public:
property XYZ^ SharedPosition {
	XYZ^ get ();
}
member SharedPosition : XYZ with get
Property Value
XYZ
See Also
Reference
BasePoint Class
Autodesk.Revit.DB Namespace